"""
Задача 1
Написать функцию, вычисляющую сумму двух переданных чисел.
"""
def sumNum():
    a = int(input("Введите число А"))
    b = int(input("Введите число В"))
    print(a + b)
sumNum()
