"""
Задача 2

Вывести на экран таблицу умножения на 3.
"""

for i in range(1, 4):
    for j in range(1, 4):
        print(i * j, end=" ")
    print("\n")
