"""
Задача 1

Вывести на экран числа от 1 до 5. Результат:

1 2 3 4 5
"""

for i in range(6):
    if i > 0:
        print(i, end=" ")
else:
    print("Конец.")
