"""
Задача 2

Заполнить список из четырёх элементов введёными строковыми значениями. Вывести
список на экран.
"""

import random

lst = 'Просто строка состоящая из несолькольких слов которую будем использовать'.split()
print(lst)
#но нам надо 4 элемента
print(lst[0:4])
